zephyrproject-rtos/hal_infineon/mtb-hal-cat1/COMPONENT_PSOC6HAL/source/cyhal_adc_sar.c
/***************************************************************************/ /**
* \file cyhal_adc_sar.c
*
* \brief
* Provides a high level interface for interacting with the Cypress Analog/Digital
* converter. This interface abstracts out the chip specific details. If any chip
* specific functionality is necessary, or performance is critical the low level
* functions can be used directly.
*
********************************************************************************
* \copyright
* Copyright 2018-2021 Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
 * \addtogroup group_hal_impl_adc ADC (Analog Digital Converter)
 * \ingroup group_hal_impl
 * \{
 * \section cyhal_adc_impl_features Features
 * The CAT1A/CAT2 (PMG/PSoC™ 4/PSoC™ 6) ADC supports the following features:
 * * Resolution: 12 bit
 * * Only @ref CYHAL_POWER_LEVEL_DEFAULT and CYHAL_POWER_LEVEL_OFF are defined. The default power
 *   level will automatically adjust based on smple rate.
 * * Average counts: 2, 4, 8, 16, 32, 64, 128, 256
 * * Up to four unique acquisition times.
 * * DMA-based transfer when using @ref cyhal_adc_read_async. When using @ref cyhal_adc_read_async_uv,
 *   only interrupt-driven software copy is supported.
 *
 * After initializing the ADC or changing the reference or bypass selection, it may be necessary to wait up to
 * 210 us for the reference buffer to settle. See the architecture TRM (Analog Subsystem -> SAR ADC ->
 * Architecture -> SARREF) for device specific guidance.
 * \} group_hal_impl_adc
 */

#include <cmsis_compiler.h>

#include "cyhal_adc.h"
#include "cyhal_analog_common.h"
#include "cyhal_clock.h"
#include "cyhal_dma.h"
#include "cyhal_gpio.h"
#include "cyhal_hwmgr.h"
#include "cyhal_utils.h"
#include "cyhal_interconnect.h"
#include "cyhal_syspm.h"
#include "cyhal_system.h"
#include <string.h>

#if (_CYHAL_DRIVER_AVAILABLE_ADC_SAR)

#if defined(CY_IP_MXS40PASS_SAR_INSTANCES)
#define _CYHAL_ADC_SAR_INSTANCES CY_IP_MXS40PASS_SAR_INSTANCES
#elif defined(CY_IP_M0S8PASS4A_SAR_INSTANCES)
#define _CYHAL_ADC_SAR_INSTANCES CY_IP_M0S8PASS4A_SAR_INSTANCES
#endif

#if defined(__cplusplus)
extern "C"
{
#endif

// The PDL for M0S8 PASS doesn't take the register as an argument; it always writes to MUX_SWITCH0
#if defined(CY_IP_M0S8PASS4A_SAR_INSTANCES)
    #define _CYHAL_ADC_SARSEQ_STATE(state) (state)
    #define _CYHAL_ADC_SWITCH_STATE(state) (state)
    #define _CYHAL_ADC_SET_SWITCH(base, mask, state) Cy_SAR_SetAnalogSwitch((base), (mask), (state))
#else
    #define _CYHAL_ADC_SWITCH_STATE(state) ((state) ? CY_SAR_SWITCH_CLOSE : CY_SAR_SWITCH_OPEN)
    #define _CYHAL_ADC_SARSEQ_STATE(state) ((state) ? CY_SAR_SWITCH_SEQ_CTRL_ENABLE : CY_SAR_SWITCH_SEQ_CTRL_DISABLE)
    #define _CYHAL_ADC_SET_SWITCH(base, mask, state) Cy_SAR_SetAnalogSwitch((base), CY_SAR_MUX_SWITCH0, (mask), _CYHAL_ADC_SWITCH_STATE((state)))
#endif

#if (CY_IP_MXS40PASS_SAR_INSTANCES == 1) && !defined(CY_DEVICE_PSOC6A256K)
    #define _CYHAL_ADC_SINGLE_UNSUFFIXED
#endif

static SAR_Type *const _cyhal_adc_base[] =
{
#if defined(_CYHAL_ADC_SINGLE_UNSUFFIXED)
    SAR,
#else
#if (_CYHAL_ADC_SAR_INSTANCES >= 1)
    SAR0,
#endif
#if (_CYHAL_ADC_SAR_INSTANCES >= 2)
    SAR1,
#endif
#if (_CYHAL_ADC_SAR_INSTANCES >= 3)
    #warning Unhandled SAR instance count
#endif
#endif
};

static const en_clk_dst_t _cyhal_adc_clock[] =
{
#if defined(_CYHAL_ADC_SINGLE_UNSUFFIXED)
    PCLK_PASS_CLOCK_SAR,
#elif (CY_IP_M0S8PASS4A_SAR_INSTANCES == 1)
    PCLK_PASS0_CLOCK_SAR,
#elif (CY_IP_MXS40PASS_SAR_INSTANCES == 1)
    PCLK_PASS_CLOCK_SAR0,
#elif (CY_IP_MXS40PASS_SAR_INSTANCES == 2)
    PCLK_PASS_CLOCK_SAR0,
    PCLK_PASS_CLOCK_SAR1,
#elif (CY_IP_M0S8PASS4A_SAR_INSTANCES == 2)
    PCLK_PASS0_CLOCK_SAR,
    PCLK_PASS1_CLOCK_SAR,
#else
    #warning Unhandled SAR instance count
#endif
};

static const cyhal_source_t _cyhal_adc_tr_out[] =
{
#if defined(_CYHAL_ADC_SINGLE_UNSUFFIXED)
    CYHAL_TRIGGER_PASS_TR_SAR_OUT,
#elif (CY_IP_M0S8PASS4A_SAR_INSTANCES == 1)
    CYHAL_TRIGGER_PASS0_TR_SAR_OUT,
#elif (CY_IP_MXS40PASS_SAR_INSTANCES == 1)
    CYHAL_TRIGGER_PASS_TR_SAR_OUT0,
#elif (CY_IP_MXS40PASS_SAR_INSTANCES == 2)
    CYHAL_TRIGGER_PASS_TR_SAR_OUT0,
    CYHAL_TRIGGER_PASS_TR_SAR_OUT1,
#elif (CY_IP_M0S8PASS4A_SAR_INSTANCES == 2)
    CYHAL_TRIGGER_PASS0_TR_SAR_OUT,
    CYHAL_TRIGGER_PASS1_TR_SAR_OUT,
#else
    #warning Unhandled SAR instance count
#endif
};

static const cyhal_dest_t _cyhal_adc_tr_in[] =
{
#if defined(_CYHAL_ADC_SINGLE_UNSUFFIXED)
    CYHAL_TRIGGER_PASS_TR_SAR_IN,
#elif (CY_IP_M0S8PASS4A_SAR_INSTANCES == 1)
    CYHAL_TRIGGER_PASS0_TR_SAR_IN,
#elif (CY_IP_MXS40PASS_SAR_INSTANCES == 1)
    CYHAL_TRIGGER_PASS_TR_SAR_IN0,
#elif (CY_IP_MXS40PASS_SAR_INSTANCES == 2)
    CYHAL_TRIGGER_PASS_TR_SAR_IN0,
    CYHAL_TRIGGER_PASS_TR_SAR_IN1,
#elif (CY_IP_M0S8PASS4A_SAR_INSTANCES == 2)
    CYHAL_TRIGGER_PASS0_TR_SAR_IN,
    CYHAL_TRIGGER_PASS1_TR_SAR_IN,
#else
    #warning Unhandled SAR instance count
#endif
};

static cyhal_adc_t* _cyhal_adc_config_structs[_CYHAL_ADC_SAR_INSTANCES];

static const IRQn_Type _cyhal_adc_irq_n[] =
{
#if defined(_CYHAL_ADC_SINGLE_UNSUFFIXED)
    pass_interrupt_sar_IRQn,
#elif (CY_IP_M0S8PASS4A_SAR_INSTANCES == 1)
    pass_0_interrupt_sar_IRQn,
#elif (CY_IP_MXS40PASS_SAR_INSTANCES == 1)
    pass_interrupt_sar_0_IRQn,
#elif (CY_IP_MXS40PASS_SAR_INSTANCES == 2)
    pass_interrupt_sar_0_IRQn,
    pass_interrupt_sar_1_IRQn,
#elif (CY_IP_M0S8PASS4A_SAR_INSTANCES == 2)
    pass_0_interrupt_sar_IRQn,
    pass_0_interrupt_sar_IRQn,
#else
    #warning Unhandled SAR instance count
#endif
};

